---
kind: other
id: Events.T:Autodesk.Revit.DB.Document
zh: 文档、文件
source: html/93d26466-11de-842c-f089-6b15b839e6af.htm
---
# Document Events

**中文**: 文档、文件

Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.